---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSelfIntersectingCurveLoopChain
source: html/113138fc-90f4-227d-e39f-62e48af19297.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSelfIntersectingCurveLoopChain Property

Curve elements forming a self-intersecting chain cannot be used as splitters and are ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceSelfIntersectingCurveLoopChain { get; }
```